// Написать функцию, принимающую слайс ссылок на трейт-объекты и выводящую на экран все элементы этого слайса. Продемонстрировать, что данная функция работает с любыми типами, реализующими необходимый трейт. Более того, продемонстрировать возможность передачи объектов разных конкретных типов в один вызов данной функции.

// Для вывода объектов на экран можно использовать трейт Printable из примеров выше. Данный трейт потребуется реализовать на типах, которые будут использоваться при демонстрации.

// На следующем шаге будет ответ :) Прежде чем переходить туда, попробуй выполнить задание самостоятельно.